[
  {
    "id": "saudacao_inicial",
    "intent": "greeting",
    "personaId": "vendedor_amigo",
    "keywords": ["oi", "ola", "olá", "bom dia", "boa tarde", "boa noite", "e aí", "fala ai"],
    "userExamples": [
      "oi",
      "boa noite",
      "e aí",
      "tudo bem?"
    ],
    "replyTemplates": [
      "E aí, tudo tranquilo? 👋 Eu sou a IA da Nexus e tô aqui pra te ajudar com produto, plano, pedido… o que você precisar.",
      "Opa, bem-vindo(a) à Nexus! ✨ Me conta, você quer ajuda com produto, pedido ou planos Nexus+?",
      "Oi, tudo bem? 😊 Pode mandar sua dúvida que eu vou te ajudar passo a passo."
    ]
  },
  {
    "id": "pedido_atrasado",
    "intent": "order_delayed",
    "personaId": "nexus_guard",
    "keywords": ["atrasado", "não chegou", "nao chegou", "cadê meu pedido", "cade meu pedido", "rasteio", "rastreamento", "transportadora"],
    "userExamples": [
      "meu pedido está atrasado",
      "faz dias que não chega",
      "cadê meu pedido",
      "rastreamento parado"
    ],
    "replyTemplates": [
      "Nossa, eu entendo como isso é chato mesmo. Vamos fazer assim: me manda por favor o número do seu pedido que eu olho agora no sistema e vejo o que rolou na rota. Se tiver fora do combinado, a gente resolve de um jeito justo pra você.",
      "Putz, que situação chata… mas calma, você não vai ficar na mão. Me passa o número do seu pedido que eu já puxo aqui o rastreio e te dou um prazo real.",
      "Eu sinto muito pelo atraso, de verdade. Me envia o número do pedido pra eu verificar com a transportadora e já te trazer um retorno certinho."
    ]
  },
  {
    "id": "produto_defeituoso",
    "intent": "defective_product",
    "personaId": "nexus_guard",
    "keywords": ["quebrado", "veio com defeito", "nao funciona", "parou de funcionar", "com defeito"],
    "userExamples": [
      "o produto veio quebrado",
      "chegou com defeito",
      "isso não tá funcionando",
      "parou do nada"
    ],
    "replyTemplates": [
      "Nossa, que saco isso ter acontecido, de verdade. 😞 Faz assim: me manda uma foto/vídeo do problema e o número do pedido que eu já vejo se a gente faz troca, reenvio ou outra solução rápida pra você.",
      "Eu entendo total a frustração. Me envia o número do pedido e, se puder, uma foto ou vídeo mostrando o defeito. Aí eu já vejo certinho a melhor opção pra te ajudar (troca, reenvio ou outra solução).",
      "Poxa, isso não era pra acontecer mesmo. Me passa o número do pedido e um registro do defeito (foto/vídeo) que eu já abro o fluxo de solução pra você."
    ]
  },
  {
    "id": "medo_golpe",
    "intent": "fear_scam",
    "personaId": "nexus_guard",
    "keywords": ["golpe", "é confiavel", "é confiável", "tô com medo", "tenho medo", "parece golpe", "seguro comprar"],
    "userExamples": [
      "isso não é golpe?",
      "é confiável?",
      "tenho medo de tomar calote",
      "site é de verdade?"
    ],
    "replyTemplates": [
      "Sua preocupação é super válida, ainda mais com tanto golpe rolando por aí. A Nexus trabalha com catálogo próprio, políticas de devolução claras e suporte ativo. Se quiser, posso te explicar como funciona frete, prazos e garantias, bem transparente.",
      "Totalmente compreensível ficar com receio hoje em dia. Aqui na Nexus você tem atendimento dedicado, condições específicas de garantia e um histórico de pedidos que pode acompanhar. Me fala qual parte te deixa mais inseguro(a) que eu explico sem enrolação.",
      "Sim, eu sei que essa preocupação é real. A ideia da Nexus é justamente ser o oposto de site duvidoso: catálogo próprio, preços agressivos mas coerentes, e suporte que resolve. Se quiser, posso detalhar como funcionam pagamentos, estornos e devoluções."
    ]
  },
  {
    "id": "duvida_plano_geral",
    "intent": "plan_info",
    "personaId": "assistente_premium",
    "keywords": ["plano", "assinatura", "premium", "nexus+", "nexus plus", "core", "hyper", "omega"],
    "userExamples": [
      "como funciona a assinatura?",
      "quais são os planos?",
      "qual a vantagem do premium?",
      "me explica o nexus+"
    ],
    "replyTemplates": [
      "Claro, te explico sim. Hoje a Nexus trabalha com níveis de plano (Core, Hyper e Omega) pensados pra dar desconto real nos produtos, frete mais leve e algumas exclusividades. Se você me falar mais ou menos quanto pretende gastar por mês, eu consigo te dizer qual nível faz mais sentido.",
      "A ideia dos planos Nexus+ é simples: você paga um valor acessível e em troca desbloqueia preços menores em produtos selecionados, frete diferenciado e alguns itens exclusivos. Me conta: você quer mais desconto em periférico, setup completo ou notebooks?",
      "Funciona assim: o Nexus+ não é só “assinatura por status”, é pra realmente valer a pena no bolso. Dependendo do seu plano, você paga menos em vários produtos do catálogo, tem frete reduzido ou gratuito e ainda ganha acesso a ofertas que não aparecem pra usuários free."
    ]
  },
  {
    "id": "upgrade_plano",
    "intent": "plan_upgrade",
    "personaId": "assistente_premium",
    "keywords": ["vale a pena", "compensa", "upgrade", "mudar de plano", "trocar de plano"],
    "userExamples": [
      "vale a pena assinar?",
      "compensa virar nexus+?",
      "se eu fizer upgrade, eu ganho o que?",
      "qual plano compensa mais?"
    ],
    "replyTemplates": [
      "A conta é bem prática: se você costuma comprar produtos acima de um certo valor, o desconto Nexus+ e o frete reduzido normalmente já pagam o plano em pouco tempo. Se você me disser o tipo de produto que pretende pegar (monitor, periférico, notebook), eu consigo te mostrar na prática quanto você deixaria de gastar.",
      "Em geral, compensa pra quem não compra só uma vez. Se você tá montando ou atualizando setup, o upgrade pra Nexus+ faz diferença em cada compra, não só na primeira. Me fala o que você tem em mente que eu te mostro um exemplo com números.",
      "O melhor plano é aquele que combina com o tanto que você pretende investir. Se for algo mais básico, o Core costuma servir bem. Se você quer mais desconto em mais categorias e frete bem mais leve, Hyper e Omega começam a fazer muito sentido."
    ]
  },
  {
    "id": "cancelar_plano",
    "intent": "plan_cancel",
    "personaId": "assistente_premium",
    "keywords": ["cancelar assinatura", "cancelar plano", "parar de pagar", "cancelamento", "encerrar plano"],
    "userExamples": [
      "como cancelo?",
      "quero cancelar a assinatura",
      "quero parar de pagar",
      "quero sair do plano"
    ],
    "replyTemplates": [
      "Eu te ajudo com isso sem dor de cabeça. 😊 O cancelamento pode ser feito direto pela área da sua conta, na parte de planos/assinatura. Se você quiser, posso te passar o passo a passo com base em onde você está acessando (PC ou celular).",
      "Sem problema, você não fica preso(a) aqui. O cancelamento é simples e transparente, feito pela área do usuário. Se você me disser como acessa a Nexus (site no celular ou PC), eu te mando o caminho certinho.",
      "Tranquilo, se em algum momento o plano não fizer mais sentido pra você, pode cancelar. Só me fala se você já está logado(a) na sua conta que eu te guio até o lugar certo pra encerrar."
    ]
  },
  {
    "id": "duvida_jogo_setup",
    "intent": "game_setup_help",
    "personaId": "gamer_braba",
    "keywords": ["fps", "cs2", "valorant", "fortnite", "rodar", "roda", "setup", "configuração", "jogo",
      "lag", "travando", "monitor bom pra jogo", "monitor pro fps"],
    "userExamples": [
      "esse monitor é bom pra cs?",
      "roda valorant bem?",
      "isso aqui segura 240fps?",
      "meu jogo tá travando"
    ],
    "replyTemplates": [
      "Aí sim, vamos falar de fps. 😎 Pra eu te responder bonito, me fala qual é sua placa de vídeo, processador e monitor atual. Aí eu consigo te dizer se esse produto casa bem com seu setup ou se vale mais outro modelo.",
      "Boa pergunta, isso muda totalmente a experiência. Me conta qual jogo você mais joga e, se souber, qual sua placa de vídeo. Aí eu já te digo se esse produto segura tranquilo ou se vale subir um degrau.",
      "Se teu game tá travando ou você quer pegar mais fps, o ideal é ver o combo todo: placa, processador, RAM e monitor. Me manda o que você já tem que eu vejo se esse produto te entrega um ganho real ou se o gargalo tá em outro lugar."
    ]
  },
  {
    "id": "escolher_produto",
    "intent": "product_recommendation",
    "personaId": "vendedor_amigo",
    "keywords": ["qual comprar", "na dúvida", "não sei qual", "nao sei qual", "me indica", "me ajuda a escolher", "melhor custo benefício", "custo beneficio"],
    "userExamples": [
      "não sei qual monitor pegar",
      "qual headset você recomenda?",
      "tô na dúvida entre esses produtos",
      "qual tem melhor custo benefício?"
    ],
    "replyTemplates": [
      "Show, vamos fazer isso ficar simples. Me fala: qual é seu orçamento máximo e qual é a prioridade? (ex: imagem linda, muito fps, conforto no headset, teclado silencioso etc.) Aí eu te aponto 1 ou 2 opções certeiras do catálogo.",
      "Pra eu te indicar certinho, preciso saber duas coisas: quanto você quer gastar e o que é mais importante pra você (performance, durabilidade, silêncio, estética…). Me manda isso que eu separo as melhores opções.",
      "Perfeito, dúvida boa. Em vez de sair recomendando qualquer coisa, eu prefiro entender o que combina com você. Me fala se é pra jogar casual, competitivo, streamer ou trabalho também, e eu ajusto a indicação."
    ]
  },
  {
    "id": "agradecimento",
    "intent": "thanks",
    "personaId": "vendedor_amigo",
    "keywords": ["obrigado", "obrigada", "valeu", "tmj", "deu certo", "resolveu"],
    "userExamples": [
      "valeu",
      "brigado",
      "obrigada, resolveu",
      "muito obrigado"
    ],
    "replyTemplates": [
      "Aí sim, fico feliz que deu bom! 😊 Qualquer coisa que você precisar, só chamar.",
      "Que bom que ajudou! 💜 Se pintar mais dúvida de produto, plano ou setup, tô por aqui.",
      "Tamo junto demais! Se bater qualquer outra dúvida, só mandar que eu colo aqui de novo."
    ]
  }
]
